In [1]:
import pandas as pd

In [2]:
student_sheet = "student_detail_test.xls"
sem_sheet = "SEM-I_master sheet_test.xls"
UTD_file = "UTD_test.csv"
current_semester = sem_sheet.split('_')[0] # Extracting Current Semester from file name.
current_semester

'SEM-I'

In [3]:

# -----------------------------
# Step 1: Read the Excel file
# -----------------------------
# Load the Excel file without headers so that rows and columns can be accessed by their index.
df_excel = pd.read_excel(sem_sheet, header=None)
df_excel

,0,1,2,3,4,5,6,7,8,9,10,11,12
0,NaN,NaN,NaN,NaN,IN6A-101,IN6A-103,IN6A-105,IN6A-107,IN6A-111,IN6A-121,IN6A-131,NaN,NaN
1,Sr No.,Student Name,Roll Number,Enrolment Number,Engineering Mathematics-I,Applied Physics-I,Engineering Chemistry,Laboratory Work,Communication Skills,Introduction to Programming and Data Structure,Comprehensive Viva Voce,SGPA,Result
2,NaN,NaN,NaN,Credits :-,4,4,4,4,4,4,4,NaN,NaN
3,1,Aamir Khan,22IOT1001,DE220203,C,C,B+,A+,A,B,A,6.857,PASS
4,2,Akshay Kumar,22IOT1002,DE220204,P,C,B,B+,A,P,B+,5.857,PASS
5,3,Ananya Pandey,22IOT1003,DE220205,P,B,P,A,B+,C,B+,5.857,PASS

In [4]:
df_student = pd.read_excel(student_sheet,header=None)
df_student

,0,1,2,3,4,5
0,Course,M.TECH.,NaN,NaN,NaN,NaN
1,Branch,INTERNET OF THINGS (IOT),NaN,NaN,NaN,NaN
2,Batch,2022-2027,NaN,NaN,NaN,NaN
3,Sr No,Name,Roll No.,Enrolment No.,Father’s Name,Mother’s Name
4,1,Aamir Khan,22IOT5001,DE220203,Mr. Bharat,Mrs. Manisha
5,2,Akshay kumar,22IOT5002,DE220204,Mr. Rakesh Kumar,Mrs. Anita
6,3,Ananya Pandey,22IOT5003,DE220205,Mr. Pawan,Mrs. Monika

In [5]:
# Extract Session for particular Batch
session = df_student.iloc[2,1]
session

'2022-2027'

In [6]:
# Extract Parents Names for all Students 
fathers_name = df_student.iloc[4:,4].reset_index(drop = True)
fathers_name

0          Mr. Bharat
1    Mr. Rakesh Kumar
2           Mr. Pawan
Name: 4, dtype: object

In [7]:
mothers_name = df_student.iloc[4:,5].reset_index(drop = True)
mothers_name

0    Mrs. Manisha
1      Mrs. Anita
2     Mrs. Monika
Name: 5, dtype: object

In [8]:

# Extract roll numbers from column C (index 2) starting from row 4 (index 3)
roll_numbers = df_excel.iloc[3:, 2].reset_index(drop=True)
type(roll_numbers)
roll_numbers

0    22IOT1001
1    22IOT1002
2    22IOT1003
Name: 2, dtype: object

In [9]:
# Extract enrollment numbers from column D (index 3) starting from row 4 (index 3)
enrollment_numbers = df_excel.iloc[3:, 3].reset_index(drop=True)
enrollment_numbers

0    DE220203
1    DE220204
2    DE220205
Name: 3, dtype: object

In [10]:
credits = df_excel.iloc[2, 4:].reset_index(drop=True)
credits = credits.dropna()
credits

0    4
1    4
2    4
3    4
4    4
5    4
6    4
Name: 2, dtype: object

In [11]:
total_subjects, total_credits = len(credits), sum(credits)
total_credits, total_subjects

(28, 7)

In [29]:
sgpa = df_excel.iloc[3:, 4 + total_subjects ].reset_index(drop=True)
sgpa

0    6.857
1    5.857
2    5.857
Name: 11, dtype: object

In [34]:
results = df_excel.iloc[3:, 5 + total_subjects].reset_index(drop=True)
results

0    PASS
1    PASS
2    PASS
Name: 12, dtype: object

In [68]:
division = sgpa.apply(lambda x: 'FIRST WITH DISTINCTION' if x >= 8.0 
                      else ('FIRST' if x >= 6.5
                      else ('SECOND' if x >= 5.0 
                            else ('PASS' if x >= 4.0 else 'FAIL'))))
division

0     FIRST
1    SECOND
2    SECOND
Name: 11, dtype: object

In [62]:
if current_semester == "SEM-I":
    cgpa = sgpa.copy()
    YEAR = int(session.split('-')[0])+1
    if YEAR == 2023:
        MONTH = "MARCH"
    else:
        MONTH = "JANUARY"
        
cgpa

0    6.857
1    5.857
2    5.857
Name: 11, dtype: object

In [63]:
YEAR,MONTH

(2023, 'MARCH')

In [44]:

# Extract Names of Student from column 'B' (index 1) starting from row 4 (index 3)
student_names = df_excel.iloc[3:, 1].reset_index(drop=True)
student_names

0       Aamir Khan
1     Akshay Kumar
2    Ananya Pandey
Name: 1, dtype: object

In [45]:
# -----------------------------
# Step 2: Read the CSV file
# -----------------------------
# Load UTD.csv; here it's assumed that the CSV does not have a header.
df_utd = pd.read_csv(UTD_file, header=None)

In [ ]:

# -----------------------------
# Step 3: Ensure UTD.csv has enough rows and columns
# -----------------------------
# Calculate required number of rows (roll/enrollment numbers etc. start at row 3)
required_rows = max(len(roll_numbers), len(enrollment_numbers)) + 2  # Account for first 2 rows
if len(df_utd) < required_rows:
    extra_rows = pd.DataFrame([[""] * df_utd.shape[1]] * (required_rows - len(df_utd)))
    df_utd = pd.concat([df_utd, extra_rows], ignore_index=True)

# Step 4: Fill constant data for all students
# -----------------------------
# For each student (starting at row 3 i.e. index 2), fill in columns A-F with constant values.

df_utd.iloc[2:required_rows, 0] = "DEVI AHILYA VISHWAVIDYALAYA INDORE"   # University Name (Column A)
df_utd.iloc[2:required_rows, 1] = "SCHOOL OF INSTRUMENTATION INDORE"     # College Name (Column B)
df_utd.iloc[2:required_rows, 2] = "INTEGRATED M.TECH (IOT)"              # Course Name in Short (Column C)
df_utd.iloc[2:required_rows, 3] = "INTEGRATED MASTER OF TECHNOLOGY"      # Full Course Name (Column D)
df_utd.iloc[2:required_rows, 4] = "INTEGRATED MASTER OF TECHNOLOGY"      # Full Course Name in Detail (Column E)
df_utd.iloc[2:required_rows, 5] = "INTERNET OF THINGS"                   # Stream (Column F)
df_utd.iloc[2:required_rows, 7] = session                                # Session for Batch 
df_utd.iloc[2:required_rows, 18] = YEAR                                  # Year for Batch  
df_utd.iloc[2:required_rows, 19] = MONTH                                 # MONTH for Batch  
df_utd.iloc[2:required_rows, 23] = current_semester.split('-')[1]        # Semester for Batch , Extracting Semester Number from file name. By SEM-I , spliting it by '-' and taking 2nd part of it.
df_utd.iloc[2:required_rows, 24] = current_semester.split('-')[0]        # Semester for Batch , Extracting Sem or Year from file name. By SEM-I , spliting it by '-' and taking 1st part of it.
df_utd.iloc[2:required_rows, 27] = total_credits                           # Total Credits for Batch

In [65]:
variable_data = {8: enrollment_numbers,  # Column : Data format
                 9: roll_numbers,
                10:student_names,
                13:fathers_name,
                14:mothers_name,
                17: results,
                20: division,
                32: cgpa,
                34: sgpa
                 }  # Dictionary of data to be written into UTD.csv

# Write data into UTD.csv
for column, values in variable_data.items():
    for i, value in enumerate(values):
        df_utd.iat[i + 2, column] = value

In [66]:
df_utd.shape

(5, 340)

In [67]:
# -----------------------------
# Step 5: Save the updated CSV file
# -----------------------------
UTD_output_file = "UTD_" + session + '_' + current_semester + '.csv' # Creating a seperate CSV file for different semesters data.
#df_utd.to_csv(UTD_output_file, index=False, header=False)
df_utd.iloc[:, 14:20]  # Display only first 15 columns

,14,15,16,17,18,19
0,MNAME,PHOTO,MRKS_REC_STATUS,RESULT,YEAR,MONTH
1,NaN,NaN,MARK O FOR ORIGINAL AND M FOR MODIFY,PASS/FAIL/W.H.,NaN,NaN
2,Mrs. Manisha,,O,PASS,2023,MARCH
3,Mrs. Anita,NaN,NaN,PASS,2023,MARCH
4,Mrs. Monika,NaN,NaN,PASS,2023,MARCH

In [ ]:
df_utd.tail()